[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
1
6
9
<
>
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
一
丁
七
万
丈
三
上
下
不
与
丐
丑
专
且
丕
世
丘
丙
业
丛
东
丝
丞
丢
两
严
丧
丨
个
丫
中
丰
串
临
丸
丹
为
主
丽
举
乃
久
么
义
之
乌
乍
乎
乏
乐
乒
乓
乔
乖
乘
乙
九
乞
也
习
乡
书
买
乱
乳
乾
了
予
争
事
二
于
亏
云
互
亓
五
井
亘
亚
些
亟
亡
亢
交
亥
亦
产
亨
亩
享
京
亭
亮
亲
亳
亵
人
亿
什
仁
仄
仅
仆
仇
仉
今
介
仍
从
仑
仓
仔
仕
他
仗
付
仙
仝
仞
仟
代
令
以
仨
仪
们
仰
仲
仵
件
价
任
份
仿
企
伊
伍
伎
伏
伐
休
众
优
伙
会
伞
伟
传
伢
伤
伥
伦
伪
伯
估
伴
伶
伸
伺
似
伽
佃
但
位
低
住
佐
佑
体
何
佗
佘
余
佚
佛
作
佟
你
佣
佩
佬
佰
佳
佶
佷
佼
使
侃
侄
侈
例
侍
侏
侗
供
依
侠
侣
侥
侦
侧
侨
侬
侮
侯
侵
便
促
俄
俅
俊
俎
俏
俐
俑
俗
俘
俜
保
俞
信
俣
俨
俩
俪
俭
修
俯
俱
俸
俺
俾
倌
倍
倒
倔
倘
候
倚
借
倡
倥
倦
倩
倪
债
值
倾
偃
假
偌
偏
做
停
健
偶
偷
偿
傀
傅
傍
傣
储
催
傲
傻
像
僚
僧
僮
僵
僻
儋
儒
儡
儿
兀
允
元
兄
充
兆
先
光
克
免
兑
兔
兖
党
兜
兢
入
全
八
公
六
兮
兰
共
关
兴
兵
其
具
典
兹
养
兼
兽
冀
内
冈
冉
册
再
冒
冕
冗
写
冚
军
农
冠
冢
冤
冥
冬
冯
冰
冲
决
况
冶
冷
冻
冼
净
凄
准
凉
凌
减
凑
凛
凝
几
凡
凤
凫
凭
凯
凰
凳
凶
凸
凹
出
击
凼
函
凿
刀
刁
刂
刃
分
切
刊
刑
划
列
刘
则
刚
创
初
删
判
刨
利
别
刮
到
制
刷
券
刹
刺
刻
剁
剂
剃
削
剌
前
剐
剑
剔
剖
剡
剥
剧
剩
剪
副
割
剿
劈
力
劝
办
功
加
务
劣
动
助
努
劫
劭
励
劲
劳
劵
劼
劾
势
勃
勇
勉
勋
勍
勐
勒
勘
募
勤
勺
勾
勿
匀
包
匆
匈
匕
化
北
匙
匝
匠
匡
匣
匦
匪
匮
匹
区
医
匾
匿
十
千
升
午
卉
半
华
协
卑
卒
卓
单
卖
南
博
卜
卞
卟
占
卡
卢
卤
卦
卧
卫
卯
印
危
即
却
卵
卷
卸
卿
厂
厄
厅
历
厉
压
厌
厍
厕
厘
厚
厝
原
厢
厥
厦
厨
厮
去
县
叁
参
又
叉
及
友
双
反
发
叔
取
受
变
叙
叛
叟
叠
口
古
句
另
叨
叩
只
叫
召
叭
叮
可
台
叱
史
右
叶
号
司
叹
叻
叼
叽
吁
吃
各
吆
合
吉
吊
同
名
后
吏
吐
向
吒
吓
吔
吕
吖
吗
君
吝
吞
吟
吠
否
吧
吨
吩
含
听
吭
启
吱
吴
吵
吶
吸
吹
吻
吼
吾
呀
呃
呆
呈
告
呐
呔
呕
呖
呗
员
呙
呛
呜
呢
呤
呦
周
呱
呲
味
呵
呷
呸
呺
呼
命
咀
咂
咄
咆
咋
和
咎
咏
咐
咒
咔
咕
咖
咙
咚
咛
咣
咦
咧
咨
咪
咬
咭
咯
咱
咳
咸
咽
咿
哀
品
哄
哆
哇
哈
响
哎
哐
哑
哒
哔
哗
哝
哟
哥
哦
哧
哨
哩
哪
哭
哮
哲
哺
哼
哽
唆
唇
唉
唐
唑
唔
唛
唠
唤
唧
唬
售
唯
唰
唱
唷
唻
唾
啃
啄
商
啉
啊
啕
啡
啤
啥
啦
啧
啪
啬
啰
啵
啸
啼
啾
喀
喂
喃
善
喆
喇
喉
喊
喋
喏
喔
喘
喜
喝
喧
喱
喳
喷
喻
喽
嗅
嗑
嗒
嗓
嗖
嗜
嗝
嗟
嗡
嗣
嗤
嗦
嗨
嗫
嗬
嗯
嗲
嗷
嗽
嘀
嘈
嘉
嘌
嘎
嘏
嘘
嘛
嘞
嘟
嘣
嘭
嘱
嘲
嘴
嘶
嘹
嘻
嘿
噉
噌
噎
噔
噗
噜
噢
器
噩
噪
噫
噬
噱
噶
噻
噼
嚎
嚏
嚒
嚓
嚣
嚯
嚷
嚼
囊
囍
囚
四
回
囟
因
团
囤
园
困
囱
围
固
国
图
圃
圆
圈
圜
土
圣
在
圩
圪
圭
地
圳
圹
场
圾
址
坂
均
坊
坍
坎
坏
坐
坑
块
坚
坛
坜
坝
坞
坟
坠
坡
坤
坦
坨
坪
坭
坯
坳
坷
坻
垂
垃
垄
垅
型
垌
垒
垚
垛
垟
垡
垢
垣
垦
垧
垫
垭
垮
垱
垴
垸
埂
埃
埇
埋
城
埒
埔
埕
埗
域
埠
埤
埭
培
基
堂
堃
堆
堇
堋
堑
堕
堠
堡
堤
堪
堰
堵
塌
塍
塑
塔
塘
塞
填
塬
境
墅
墒
墓
増
墘
墙
增
墟
墨
墩
壁
壆
壕
壤
士
壬
壮
声
壳
壶
壹
处
备
复
夏
夔
夕
外
夙
多
夜
够
大
天
太
夫
夭
央
失
头
夷
夸
夹
夺
夼
奂
奄
奇
奈
奉
奋
奎
奏
契
奔
奕
奖
套
奚
奠
奢
奥
女
奴
奶
奸
她
好
如
妃
妄
妆
妇
妈
妊
妍
妒
妓
妖
妗
妙
妞
妤
妥
妧
妨
妩
妪
妫
妮
妯
妲
妹
妻
妾
姆
姊
始
姐
姑
姓
委
姗
姚
姜
姝
姣
姥
姨
姬
姻
姿
威
娃
娄
娅
娆
娇
娈
娉
娌
娓
娘
娜
娟
娠
娣
娥
娩
娱
娲
娴
娶
娼
婆
婉
婊
婓
婕
婚
婢
婧
婪
婴
婵
婶
婷
婺
婿
媒
媚
媛
媲
媳
嫁
嫂
嫄
嫉
嫌
嫒
嫔
嫖
嫘
嫙
嫣
嫦
嫩
嬉
嬛
嬢
嬴
嬷
子
孔
孕
字
存
孙
孚
孛
孜
孝
孟
孢
季
孤
学
孩
孰
孱
孵
孺
孽
宁
它
宅
宇
守
安
宋
完
宏
宓
宕
宗
官
宙
定
宛
宜
宝
实
宠
审
客
宣
室
宥
宦
宪
宫
宰
害
宴
宵
家
宸
容
宽
宾
宿
寂
寄
寅
密
寇
富
寐
寒
寓
寝
寞
察
寡
寤
寥
寨
寮
寰
寸
对
寺
寻
导
寿
封
射
将
尉
尊
小
少
尔
尖
尘
尙
尚
尝
尤
尧
尬
就
尴
尸
尹
尺
尼
尽
尾
尿
局
屁
层
屄
居
屈
屉
届
屋
屎
屏
屑
展
属
屠
屡
履
屯
山
屹
屾
屿
岁
岂
岐
岑
岔
岖
岗
岘
岙
岚
岛
岢
岩
岫
岭
岱
岳
岵
岷
岸
岽
岿
峄
峒
峙
峡
峤
峥
峦
峨
峪
峭
峰
峻
崂
崃
崆
崇
崎
崔
崖
崛
崤
崧
崩
崭
崮
崴
崽
崾
嵇
嵊
嵋
嵌
嵘
嵛
嵩
嵬
嶂
巅
巍
巛
川
州
巡
巢
工
左
巧
巨
巩
巫
差
己
已
巳
巴
巷
巾
币
市
布
帅
帆
师
希
帐
帕
帖
帘
帚
帛
帜
帝
带
帧
席
帮
帷
常
帼
帽
幂
幅
幌
幕
幢
干
平
年
并
幸
幺
幻
幼
幽
广
庄
庆
庇
床
庋
序
庐
庑
庒
库
应
底
店
庙
庚
府
庞
废
度
座
庭
庵
庶
康
庸
庹
廉
廊
廓
廖
廛
延
廷
建
廿
开
异
弃
弄
弈
弊
弋
式
弓
引
弗
弘
弛
弟
张
弥
弦
弧
弯
弱
弹
强
弼
彀
彐
归
当
录
彗
彝
形
彤
彦
彩
彪
彬
彭
彰
影
彷
役
彻
彼
往
征
径
待
很
徊
律
後
徐
徒
徕
得
徘
徙
御
徨
循
微
徳
德
徽
心
必
忆
忌
忍
忏
忐
忑
忒
志
忘
忙
忠
忡
忧
快
忱
念
忻
忽
怀
态
怂
怄
怅
怎
怒
怔
怕
怖
怜
思
怠
怡
急
怦
性
怨
怪
怯
怵
总
怼
恁
恃
恋
恍
恐
恒
恕
恙
恢
恤
恨
恩
恪
恬
恭
息
恰
恳
恶
恺
恼
恿
悄
悉
悍
悔
悖
悚
悝
悟
悠
患
悦
您
悬
悯
悲
悴
悼
情
惆
惊
惋
惑
惕
惘
惚
惜
惟
惠
惦
惧
惨
惩
惫
惬
惭
惮
惯
惰
想
惶
惹
惺
愁
愈
愉
意
愚
感
愣
愤
愧
愫
愿
慈
慊
慌
慎
慑
慕
慢
慧
慨
慰
慷
憋
憔
憧
憨
憩
憬
憾
懂
懈
懊
懋
懒
懦
懵
懿
戈
戊
戍
戎
戏
成
我
戒
或
战
戚
截
戬
戮
戳
戴
户
房
所
扁
扇
扈
扉
手
才
扎
扑
扒
打
扔
托
扛
扣
扦
执
扩
扪
扫
扬
扭
扮
扯
扰
扳
扶
批
扼
找
承
技
抄
抉
把
抑
抒
抓
投
抖
抗
折
抚
抛
抠
抢
护
报
抨
披
抬
抱
抵
抹
抻
押
抽
抿
拂
拄
担
拆
拇
拈
拉
拌
拍
拎
拐
拒
拓
拔
拖
拗
拘
拙
招
拜
拟
拢
拣
拥
拦
拧
拨
择
括
拭
拮
拯
拱
拳
拴
拷
拼
拽
拾
拿
持
挂
指
按
挎
挑
挖
挚
挛
挝
挞
挟
挠
挡
挣
挤
挥
挨
挪
挫
振
挹
挺
挽
捂
捅
捆
捉
捋
捌
捍
捎
捏
捐
捕
捞
损
捡
换
捣
捧
据
捯
捱
捶
捷
捺
捻
掀
掂
掇
授
掉
掌
掏
掐
排
掖
掘
探
掣
接
控
推
掩
措
掰
掳
掴
掷
掺
揉
揍
描
提
插
揖
握
揣
揩
揪
揭
援
揽
揿
搁
搂
搅
搏
搐
搓
搔
搜
搞
搪
搬
搭
搴
携
摁
摄
摆
摇
摊
摒
摔
摘
摞
摧
摩
摸
摹
撂
撅
撇
撑
撒
撕
撞
撤
撩
撬
播
撮
撰
撵
撸
撺
撼
擀
擂
擅
操
擎
擒
擦
攀
攒
攘
攥
攫
支
收
攸
改
攻
放
政
故
效
敌
敏
救
敔
敖
教
敛
敝
敞
敢
散
敦
敬
数
敲
整
敷
文
斋
斌
斐
斑
斓
斗
料
斜
斟
斡
斤
斥
斧
斩
断
斯
新
方
於
施
旁
旅
旋
旌
旎
族
旖
旗
无
既
日
旦
旧
旨
早
旬
旭
旮
旯
旱
时
旷
旺
昀
昂
昆
昊
昌
明
昏
易
昔
昕
昙
昝
星
映
春
昧
昨
昭
是
昱
昵
昶
昼
显
晁
晃
晋
晌
晏
晒
晓
晔
晕
晖
晗
晚
晟
晤
晦
晨
普
景
晰
晴
晶
智
晾
暂
暄
暇
暑
暖
暗
暧
暨
暮
暴
暹
暾
曈
曙
曜
曝
曦
曰
曲
曳
更
曹
曼
曾
替
最
月
有
朋
服
朐
朔
朕
朗
望
朝
期
朦
木
未
末
本
札
术
朱
朴
朵
机
朽
杀
杂
权
杆
杈
杉
李
杏
材
村
杓
杖
杜
杞
束
杠
条
来
杨
杩
杪
杭
杯
杰
杳
杵
杷
杼
松
板
极
构
枇
枉
枋
析
枕
林
枚
果
枝
枞
枢
枣
枧
枪
枫
枭
枯
枰
枳
架
枷
枸
柄
柏
某
柑
柒
染
柔
柘
柚
柜
柞
柠
查
柬
柯
柱
柳
柴
査
柿
栅
标
栈
栋
栎
栏
树
栓
栖
栗
校
栩
株
栲
样
核
根
格
栽
栾
桂
桃
桄
桅
框
案
桉
桌
桐
桑
桓
桔
桠
桡
桢
档
桥
桦
桧
桨
桩
桶
桷
梁
梅
梆
梓
梗
梢
梦
梧
梨
梭
梯
械
梳
梵
检
棉
棋
棍
棒
棕
棘
棚
棠
棣
森
棰
棱
棵
棺
椅
椋
植
椎
椒
椤
椭
椰
椹
椿
楂
楔
楗
楚
楝
楞
楠
楣
楦
楷
楸
楹
楼
概
榄
榆
榈
榉
榔
榕
榛
榜
榧
榨
榫
榭
榱
榴
榷
榻
槌
槎
槐
槛
槟
槽
槿
樊
樟
模
樨
横
樱
樵
樽
樾
橄
橘
橙
橛
橡
橱
檀
檐
檩
檬
欠
次
欢
欣
欧
欲
欺
款
歆
歇
歉
歌
歙
止
正
此
步
武
歧
歪
歹
死
歼
殃
殆
殇
殊
残
殖
殡
殴
段
殷
殿
毁
毂
毅
毋
母
每
毒
毓
比
毕
毗
毙
毛
毡
毫
毯
毽
氏
氐
民
氓
气
氛
氟
氢
氦
氧
氨
氪
氮
氯
氰
水
永
汀
汁
求
汇
汉
汊
汐
汕
汗
汛
汝
汞
江
池
污
汤
汨
汪
汰
汲
汴
汶
汹
汽
汾
沁
沂
沃
沅
沈
沉
沌
沐
沓
沔
沙
沛
沟
没
沣
沥
沦
沧
沩
沪
沫
沭
沮
沱
河
沸
油
治
沼
沽
沾
沿
泄
泉
泊
泌
泓
法
泗
泛
泠
泡
波
泣
泥
注
泪
泮
泯
泰
泱
泳
泵
泷
泸
泺
泻
泼
泽
泾
洁
洋
洌
洒
洗
洙
洛
洞
津
洧
洪
洮
洱
洲
洳
洵
洸
洹
洺
活
洼
洽
派
流
浅
浆
浇
浈
浉
浊
测
浍
济
浏
浐
浑
浒
浓
浔
浙
浚
浜
浠
浣
浦
浩
浪
浮
浯
浴
海
浸
浼
涂
涅
消
涉
涌
涎
涑
涓
涔
涕
涛
涝
涞
涟
涠
涡
涣
涤
润
涧
涨
涩
涪
涫
涮
涯
液
涵
涸
涿
淀
淄
淅
淆
淇
淋
淌
淑
淖
淘
淙
淝
淞
淡
淤
淦
淫
淮
深
淳
混
淹
添
淼
清
渊
渌
渍
渎
渐
渑
渔
渗
渚
渝
渠
渡
渣
渤
渥
温
渭
港
渴
游
渺
湃
湄
湉
湖
湘
湛
湟
湫
湲
湴
湾
湿
溃
溅
溆
溇
溉
溏
源
溜
溟
溢
溥
溧
溪
溯
溱
溶
溺
滁
滂
滃
滇
滋
滏
滑
滔
滕
滘
滚
滞
滟
滠
满
滢
滤
滥
滦
滧
滨
滩
滴
漂
漆
漉
漏
漓
演
漕
漠
漩
漪
漫
漯
漱
漳
漾
潇
潋
潍
潘
潜
潞
潢
潦
潭
潮
潺
潼
澄
澈
澍
澎
澜
澡
澥
澧
澳
澶
澹
激
濂
濉
濑
濒
濠
濡
濮
濯
瀑
瀚
瀛
瀵
瀹
灌
灏
灞
火
灭
灯
灰
灵
灶
灸
灼
灾
灿
炀
炅
炆
炉
炊
炎
炒
炔
炕
炖
炘
炜
炫
炬
炭
炮
炯
炳
炸
点
炼
炽
烁
烂
烈
烊
烔
烘
烙
烛
烟
烤
烦
烧
烨
烩
烫
烬
热
烯
烷
烹
烽
焉
焊
焕
焖
焘
焙
焚
焜
焦
焯
焰
焱
然
煊
煌
煎
煜
煞
煤
煦
照
煨
煮
煲
煽
熄
熊
熏
熔
熙
熟
熠
熨
熬
熳
熹
燃
燊
燎
燕
燥
爆
爪
爬
爰
爱
爵
父
爷
爸
爹
爻
爽
片
版
牌
牒
牙
牛
牟
牡
牢
牦
牧
物
牯
牲
牵
特
牺
犀
犁
犄
犊
犍
犒
犟
犬
犯
状
犷
犹
狂
狄
狈
狐
狗
狠
狡
狩
独
狭
狮
狱
狲
狸
狻
狼
猎
猓
猕
猖
猗
猛
猜
猝
猢
猥
猩
猪
猫
猬
献
猴
猾
猿
獐
獗
獾
玄
率
玉
王
玑
玖
玛
玟
玢
玩
玫
玮
环
现
玲
玷
玺
玻
珀
珂
珈
珉
珊
珍
珏
珑
珙
珞
珠
珣
珥
珩
珪
班
珲
球
琅
理
琉
琊
琏
琐
琛
琢
琥
琦
琨
琪
琬
琮
琰
琳
琴
琵
琶
琼
瑁
瑕
瑗
瑙
瑚
瑛
瑜
瑞
瑟
瑧
瑰
瑶
瑾
璀
璁
璃
璇
璋
璎
璐
璜
璞
璧
璨
璺
瓜
瓢
瓣
瓦
瓮
瓯
瓶
瓷
甄
甘
甚
甜
生
甥
用
甩
甪
甫
甬
甭
甯
田
由
甲
申
电
男
甸
町
画
畅
畈
畋
界
畏
畔
留
畜
略
番
畲
畴
畸
畹
疃
疆
疏
疑
疗
疙
疚
疝
疡
疤
疥
疫
疮
疯
疱
疲
疵
疸
疹
疼
疾
病
症
痊
痒
痔
痕
痘
痛
痞
痣
痧
痪
痫
痰
痴
痹
痿
瘁
瘘
瘟
瘤
瘦
瘩
瘪
瘫
瘴
瘸
瘾
癀
癌
癖
癜
癣
癫
癸
登
白
百
皂
的
皆
皇
皋
皎
皑
皓
皖
皙
皮
皱
皿
盂
盆
盈
益
盏
盐
监
盒
盔
盖
盗
盘
盛
盟
盥
目
盯
盱
盲
直
相
盼
盾
省
眉
看
眙
真
眠
眨
眩
眭
眯
眶
眷
眸
眺
眼
着
睁
睐
睛
睡
睢
督
睦
睫
睬
睹
睾
睿
瞄
瞅
瞌
瞎
瞑
瞒
瞟
瞥
瞧
瞩
瞪
瞬
瞰
瞳
瞻
瞿
矗
矛
矜
矢
矣
知
矩
矫
短
矮
石
矶
矸
矽
矾
矿
砀
码
砂
砉
砌
砍
研
砖
砚
砝
砣
砥
砦
砧
砬
砰
破
砸
砺
砻
砼
砾
础
硅
硇
硌
硐
硒
硕
硖
硝
硫
硬
确
硼
碁
碉
碌
碍
碎
碑
碓
碗
碘
碚
碛
碜
碟
碣
碧
碰
碱
碳
碴
碾
磁
磅
磊
磋
磐
磕
磨
磴
磷
磺
磻
礁
示
礼
社
祀
祁
祈
祉
祖
祚
祛
祝
神
祟
祠
祥
票
祭
祯
祷
祸
祺
禀
禁
禄
禅
福
禧
禹
禺
离
禽
禾
秀
私
秃
秆
秉
秋
种
科
秒
秘
租
秣
秤
秦
秧
秩
秭
积
称
秸
移
秽
稀
程
稍
税
稚
稞
稠
稣
稳
稷
稹
稻
稼
稽
稿
穆
穑
穗
穴
究
穷
穸
穹
空
穿
突
窃
窄
窈
窍
窑
窒
窕
窖
窗
窘
窜
窝
窟
窠
窥
窦
窨
窿
立
竖
站
竞
竟
章
竣
童
竭
端
竹
竺
竽
竿
笃
笆
笈
笋
笏
笑
笔
笕
笙
笛
笠
笥
符
笨
笪
第
笺
笼
笾
等
筋
筏
筐
筑
筒
答
策
筛
筝
筠
筱
筵
筷
筹
筼
签
简
箉
箍
箐
箔
箕
算
管
箦
箩
箫
箬
箭
箱
篁
篆
篇
篑
篓
篙
篝
篡
篮
篱
篷
簇
簋
簌
簧
簸
簿
籁
籍
米
类
籽
粉
粑
粒
粕
粗
粘
粟
粤
粥
粪
粮
粱
粲
粹
粽
精
糊
糕
糖
糗
糙
糜
糟
糠
糯
糸
系
紊
素
索
紧
紫
累
絮
綦
繁
繇
纠
红
纤
约
级
纨
纪
纫
纬
纭
纯
纰
纱
纲
纳
纵
纶
纷
纸
纹
纺
纽
线
绀
练
组
绅
细
织
终
绊
绋
绍
绎
经
绑
绒
结
绔
绕
绗
绘
给
绚
绛
络
绝
绞
统
绠
绢
绣
绥
绦
继
绩
绪
绫
续
绮
绯
绰
绳
维
绵
绶
绷
绸
绺
综
绽
绾
绿
缀
缁
缃
缅
缆
缇
缈
缉
缎
缑
缓
缔
缕
编
缘
缙
缚
缝
缠
缤
缥
缦
缨
缩
缪
缭
缮
缴
缶
缸
缺
罂
罄
罐
网
罔
罕
罗
罘
罚
罡
罢
罩
罪
置
署
羁
羊
羌
美
羔
羚
羞
羡
群
羯
羲
羸
羹
羽
羿
翀
翁
翃
翅
翊
翌
翎
翔
翕
翘
翟
翠
翡
翥
翩
翰
翱
翻
翼
耀
老
考
者
而
耍
耐
耒
耕
耗
耘
耙
耳
耶
耸
耻
耽
耿
聂
聃
聆
聊
聋
职
联
聘
聚
聪
聿
肃
肆
肇
肉
肋
肌
肓
肖
肘
肚
肛
肝
肟
肠
股
肢
肤
肥
肩
肪
肯
育
肴
肺
肽
肾
肿
胀
胁
胃
胆
背
胍
胎
胖
胚
胛
胜
胞
胡
胤
胥
胧
胪
胫
胭
胯
胰
胱
胳
胶
胸
胺
能
脂
脆
脉
脊
脏
脐
脑
脓
脖
脚
脯
脱
脸
脾
腆
腈
腊
腌
腐
腑
腓
腔
腕
腚
腥
腮
腰
腱
腹
腺
腻
腼
腾
腿
膀
膈
膊
膏
膘
膛
膜
膝
膨
膳
膺
臀
臂
臆
臊
臣
臧
自
臭
至
致
臻
臼
臾
舀
舅
舆
舌
舍
舒
舔
舜
舞
舟
舣
航
舫
般
舰
舱
舵
舶
舸
船
舻
艇
艋
艘
艮
良
艰
色
艳
艹
艺
艾
节
芈
芊
芋
芍
芏
芒
芗
芘
芙
芜
芝
芡
芥
芦
芩
芪
芫
芬
芭
芮
芯
花
芳
芷
芸
芹
芽
芾
苇
苍
苏
苑
苒
苓
苔
苕
苗
苘
苛
苜
苞
苟
苣
若
苦
苯
英
苷
苹
苾
茁
茂
范
茄
茅
茆
茉
茌
茎
茑
茗
茛
茜
茧
茨
茫
茬
茭
茯
茱
茴
茵
茶
茸
茹
荀
荃
荆
草
荐
荒
荔
荚
荞
荟
荠
荡
荣
荤
荥
荧
荫
荭
药
荷
荻
莅
莆
莉
莎
莒
莓
莘
莜
莞
莪
莫
莱
莲
莳
获
莹
莺
莼
莽
菀
菁
菅
菇
菊
菌
菏
菖
菜
菠
菡
菩
菱
菲
菹
萃
萄
萆
萌
萍
萎
萝
萤
营
萧
萨
萱
落
葆
葑
著
葚
葛
葡
董
葩
葫
葬
葱
葳
葵
蒂
蒋
蒌
蒗
蒙
蒜
蒡
蒯
蒲
蒸
蒿
蓄
蓉
蓑
蓓
蓖
蓝
蓟
蓥
蓬
蓿
蔑
蔓
蔗
蔚
蔟
蔡
蔬
蔷
蔺
蔻
蔼
蔽
蕃
蕈
蕉
蕊
蕙
蕨
蕰
蕲
蕴
蕾
薄
薅
薇
薛
薪
薯
薰
薷
藁
藉
藏
藐
藕
藤
藩
藻
藿
蘑
蘩
蘸
虎
虏
虑
虓
虔
虚
虞
虢
虫
虬
虹
虽
虾
蚀
蚁
蚂
蚊
蚌
蚓
蚕
蚝
蚤
蚪
蚬
蚯
蚶
蛇
蛊
蛋
蛎
蛔
蛙
蛛
蛟
蛤
蛮
蛳
蛹
蛾
蜀
蜂
蜊
蜓
蜕
蜗
蜘
蜚
蜜
蜡
蜻
蝇
蝉
蝌
蝎
蝗
蝙
蝠
蝴
蝶
螂
螃
融
螨
螳
螺
蟀
蟊
蟑
蟛
蟠
蟥
蟹
蟾
蠓
蠡
蠢
血
衅
行
衍
衔
街
衙
衡
衢
衣
补
表
衩
衫
衬
衮
衰
衷
袁
袂
袄
袅
袆
袋
袍
袒
袖
袜
袢
袤
被
袭
袱
裁
裂
装
裔
裕
裘
裙
裤
裱
裳
裴
裸
裹
裼
褂
褐
褒
褔
褚
褥
褪
褶
襄
襟
西
要
覃
覆
见
观
规
觅
视
览
觉
觊
觎
觐
角
解
触
言
訾
詈
詹
誉
誊
誓
警
譬
计
订
认
讨
让
讪
讫
训
议
讯
记
讲
讳
讴
讶
讷
许
讹
论
讼
讽
设
访
诀
证
评
诅
识
诈
诉
诊
诋
词
诏
译
诓
试
诗
诘
诙
诚
诛
话
诞
诠
诡
询
诣
诤
该
详
诧
诩
诫
诬
语
误
诰
诱
说
诵
诶
请
诸
诺
读
诽
课
诿
谁
调
谅
谆
谈
谊
谋
谌
谍
谎
谏
谐
谓
谕
谗
谙
谚
谛
谜
谟
谢
谣
谤
谥
谦
谧
谨
谩
谬
谭
谯
谱
谷
豁
豆
豌
豚
象
豪
豫
豸
豹
貂
貉
貌
贝
贞
负
贡
财
责
贤
败
账
货
质
贩
贪
贫
贬
购
贯
贰
贱
贲
贴
贵
贷
贸
费
贺
贻
贼
贾
贿
赁
赂
赃
资
赅
赉
赊
赋
赌
赎
赏
赐
赓
赔
赖
赘
赚
赛
赜
赝
赞
赠
赡
赢
赣
赤
赦
赫
走
赴
赵
赶
起
趁
超
越
趋
趟
趣
足
趴
趸
趺
趾
跃
跆
跋
跌
跐
跑
距
跟
跤
跨
跪
跫
路
跳
践
跷
跺
跻
踊
踌
踏
踝
踞
踢
踩
踪
踵
踹
蹄
蹇
蹈
蹊
蹋
蹙
蹦
蹩
蹬
蹭
蹲
蹴
蹿
躁
躇
身
躲
躺
车
轧
轨
轩
转
轮
软
轰
轱
轲
轴
轵
轶
轸
轻
轼
载
轿
较
辄
辅
辆
辇
辈
辉
辊
辋
辍
辐
辑
输
辔
辕
辖
辗
辘
辙
辛
辜
辞
辟
辣
辨
辩
辫
辰
辱
边
辽
达
迁
迄
迅
过
迈
迎
运
近
返
还
这
进
远
违
连
迟
迢
迦
迩
迪
迫
迭
述
迳
迷
迸
迹
追
退
送
适
逃
逄
逅
逆
选
逊
逍
透
逐
逑
递
途
逖
逗
通
逛
逝
逞
速
造
逢
逦
逮
逯
逵
逸
逻
逼
逾
遂
遄
遇
遍
遏
遐
遒
道
遗
遛
遢
遣
遥
遨
遭
遮
遵
避
邀
邂
邈
邋
邑
邓
邕
邗
邙
邛
邝
邡
邢
那
邦
邪
邬
邮
邯
邰
邱
邳
邴
邵
邸
邹
邺
邻
邾
郁
郄
郅
郇
郊
郎
郏
郐
郑
郓
郗
郜
郝
郡
郢
郦
郧
部
郫
郭
郯
郴
郸
都
郾
鄂
鄄
鄙
鄞
鄠
鄢
鄣
鄯
鄱
酉
酋
酌
配
酐
酒
酗
酚
酝
酥
酪
酬
酮
酯
酱
酵
酶
酷
酸
酾
酿
醇
醉
醋
醒
醛
醪
醴
采
釉
释
里
重
野
量
金
釜
鉴
銮
鏊
鑫
针
钉
钊
钎
钏
钒
钓
钕
钗
钙
钛
钜
钝
钞
钟
钠
钢
钣
钤
钥
钦
钧
钨
钩
钬
钮
钰
钱
钲
钳
钵
钹
钺
钻
钼
钾
钿
铀
铁
铂
铃
铅
铆
铉
铎
铐
铒
铖
铛
铜
铝
铠
铢
铣
铧
铨
铬
铭
铮
铰
铲
银
铸
铺
链
铿
销
锁
锂
锄
锅
锈
锉
锋
锌
锍
锏
锐
锓
锗
错
锚
锛
锟
锡
锢
锣
锤
锥
锦
锩
锬
锭
键
锯
锰
锲
锴
锵
锶
锷
锹
锻
镀
镁
镇
镉
镐
镑
镒
镔
镖
镗
镛
镜
镭
镯
镳
镶
长
门
闩
闪
闫
闭
问
闯
闰
闱
闲
间
闵
闶
闷
闸
闹
闺
闻
闼
闽
阀
阁
阂
阄
阅
阆
阊
阎
阐
阑
阔
阕
阖
阙
阚
阜
队
阡
阪
阮
阱
防
阳
阴
阵
阶
阻
阿
陀
陂
附
际
陆
陇
陈
陉
陋
陌
降
限
陔
陕
陛
陟
陡
院
除
陨
险
陪
陵
陶
陷
隅
隆
隋
隍
随
隐
隔
隗
隘
隙
障
隧
隰
隳
隶
隼
隽
难
雀
雁
雄
雅
集
雇
雌
雍
雏
雒
雕
雨
雪
雯
雳
零
雷
雹
雾
需
霁
霄
霆
震
霈
霉
霍
霏
霓
霖
霜
霞
露
霸
霹
霾
青
靓
靖
静
靛
非
靠
靡
面
革
靳
靴
靶
鞋
鞍
鞘
鞠
鞭
韦
韧
韩
韫
韬
韭
音
韵
韶
页
顶
顷
项
顺
须
顽
顾
顿
颀
颁
颂
预
颅
领
颇
颈
颉
颊
颌
颍
颐
频
颓
颔
颖
颗
题
颚
颛
颜
额
颠
颤
风
飒
飓
飘
飙
飚
飞
食
飧
餍
餐
饕
饥
饨
饪
饭
饮
饯
饰
饱
饲
饵
饶
饷
饸
饺
饼
饽
饿
馀
馁
馄
馅
馆
馈
馋
馍
馒
馓
首
馗
香
馥
馨
马
驭
驮
驯
驰
驱
驳
驴
驶
驷
驸
驹
驻
驼
驾
驿
骁
骂
骄
骅
骆
骇
骊
骋
验
骏
骐
骑
骓
骗
骚
骛
骞
骡
骢
骤
骥
骧
骨
骷
骼
髅
髋
髓
高
髦
鬼
魁
魂
魄
魅
魏
魔
鱼
鱿
鲁
鲂
鲅
鲇
鲈
鲍
鲛
鲜
鲟
鲢
鲤
鲨
鲫
鲲
鲶
鲸
鲽
鳄
鳅
鳌
鳕
鳖
鳗
鳜
鳝
鳞
鶄
鸟
鸠
鸡
鸢
鸣
鸥
鸦
鸭
鸯
鸳
鸵
鸽
鸾
鸿
鹂
鹃
鹄
鹅
鹉
鹊
鹋
鹏
鹗
鹤
鹦
鹩
鹭
鹰
鹿
麒
麓
麝
麟
麦
麸
麻
麽
麾
黄
黉
黍
黎
黏
黑
黔
默
黛
黝
黢
黾
鼋
鼎
鼓
鼗
鼠
鼻
齐
齿
龄
龆
龈
龊
龋
龌
龙
龚
龛
龟
！
